package УрокиПоJAVA._219_Аннотации_ограничения;
public class Q {
    /*
    Существует ряд ограничений , накладываемых н а объявления аннотаций. Вопервых,
одна аннотация не может наследовать другую. Во-вторых, все методы,
объявленные в аннотации, должны быть без параметров. Кроме того, они должны
возвращать один из перечисленных ниже типов:
1) примитивный тип наподобие int или double;
2) объект класса String или Class;
3) перечислимый тип;
4) тип другой аннотации;
5) массив одного из предыдущих типов.
Аннотации не могут быть обобщенными. Иными словами, они не могут принимать  параметры
типа. И наконец,  при объявлении методов в аннотациях нельзя указывать оператор throws.
     */
}
